rhobison/esport-fi32/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.3 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y
CONFIG_LWIP_IP_FORWARD=y
CONFIG_LWIP_IPV4_NAPT=y
CONFIG_LWIP_STATS=y
# Increase FreeRTOS timer daemon task stack from the 2048-byte default.
# The session_trk_qualify_timer_cb and session_trk_idle_timer_cb perform
# multiple 64-bit divisions and call esp_event_post + ESP_LOGI with PRId64,
# all of which use substantial stack via software arithmetic routines on
# RISC-V 32-bit.  2048 bytes is insufficient and causes stack overflow,
# which manifests as a Cache access error (MCAUSE=0x19) on ESP32-C6.
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
# Increase ESP timer task stack from 3584-byte default.  device_reg_tick()
# allocates wifi_sta_list_t (~124 bytes) and snapshot arrays on the stack,
# and calls esp_wifi_ap_get_sta_list(), config_mngr_* getters, ESP_LOGI
# formatting, and wifi_mngr_dbg_filter_log().  3584 bytes is too tight and
# causes a stack overflow that corrupts libc mutex state, resulting in an
# abort() inside lock_acquire_generic.
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144
